# Make sure we’re using the latest Homebrew
update

# Upgrade any already-installed formula
upgrade

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/nano'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/screen'
brew 'homebrew/dupes/less'

# Install tools
brew 'mas'
brew 'htop'
brew 'the_silver_searcher'
brew 'fasd'
brew 'git'
brew 'wget'
brew 'less'
#brew 'iperf'
#brew 'ipcalc'
#brew 'dhcpdump'
#brew 'mtr'
brew 'nmap'
brew 'csshx'
brew 'curl'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'ansible'
brew 'antigen'
brew 'docker-clean'
brew 'ctop'
brew 'prettyping'

# Applications
cask 'dropbox'
cask 'firefox'
cask 'cleanmymac'
cask 'google-chrome'
cask 'phpstorm'
cask 'sequel-pro'
cask 'sublime-text'
cask 'vlc'
cask 'whatsapp'
cask 'spotify'
cask 'bartender'
cask 'cakebrew'
cask 'little-snitch'
cask 'viscosity'
cask 'sonos'
#cask 'macs-fan-control'
cask 'istumbler'
cask 'insomnia'
cask 'robomongo'
cask 'docker'
cask 'kitematic'
cask 'alfred'

# Fonts
cask 'font-inconsolata'
cask 'font-inconsolata-dz'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-comfortaa'
cask 'font-hack'
cask 'font-nexa'
cask 'font-montserrat'

# App store
#mas 412529613 # Cinch
mas 425424353 # Unarchiver
mas 948176063 # Boom
mas 803453959 # Slack
mas 409203825 # Numbers
mas 409201541 # Pages
mas 409183694 # Keynote
mas 1107421413 # 1Blocker
mas 1020812363 # Copyclip
mas 981117463 # Chatty
mas 972028355 # Microsnitch
mas 1333542190 # 1Password
mas 585829637 # Todoist
mas 441258766 # Magnet
mas 1147396723 # Whatsapp

# Remove outdated versions from the cellar
cleanup
