# Make sure we’re using the latest Homebrew
update

# Upgrade any already-installed formula
upgrade

# Taps
tap 'homebrew/php'
#tap 'blackfireio/blackfire'
#tap 'jenssegers/custom'
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/nano'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/screen'

# Install tools
brew 'mas'
brew 'htop'
brew 'the_silver_searcher'
brew 'git'
brew 'wget'
#brew 'iperf'
#brew 'ipcalc'
#brew 'dhcpdump'
brew 'mtr'
brew 'nmap'
brew 'csshx'
brew 'watch'
brew 'ruby'
brew 'curl'
brew 'zsh'
brew 'zsh-completions'
brew 'node'
brew 'php71'
brew 'php71-apcu'
#brew 'php71-gmp'
brew 'php71-redis'
brew 'php71-xdebug'
brew 'php71-mongodb'
#brew 'blackfire-php71'
brew 'composer'
brew 'python'
brew 'python3'

# Applications
cask '1password'
cask 'dropbox'
cask 'firefox'
cask 'cleanmymac'
cask 'google-chrome'
cask 'flux'
cask 'phpstorm'
cask 'sequel-pro'
cask 'sublime-text'
cask 'vlc'
cask 'whatsapp'
cask 'spotify'
cask 'bartender'
cask 'kibako'
cask 'cakebrew'
cask 'little-snitch'
cask 'viscosity'
cask 'sonos'
cask 'macs-fan-control'
cask 'istumbler'
cask 'insomnia'

# Fonts
cask 'font-inconsolata'
cask 'font-inconsolata-dz'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-comfortaa'
cask 'font-hack'
cask 'font-nexa'
cask 'font-montserrat'

# App store
mas 412529613 # Cinch
mas 909257784 # Denied
mas 425424353 # Unarchiver
mas 948176063 # Boom
mas 972028355 # Micro snitch
mas 803453959 # Slack
mas 409203825 # Numbers
mas 409201541 # Pages
mas 409183694 # Keynote
mas 449589707 # Dash
mas 1176895641 # Spark
mas 1107421413 # 1Blocker
mas 1020812363 # Copyclip

# Remove outdated versions from the cellar
cleanup
