# Make sure we’re using the latest Homebrew
update

# Upgrade any already-installed formula
upgrade

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'

# Install tools
#brew 'dhcpdump'
#brew 'ipcalc'
#brew 'iperf'
#brew 'mtr'
#brew 'nmap'
brew 'ansible'
brew 'csshx'
brew 'ctop'
brew 'curl'
brew 'docker-clean'
brew 'fasd'
brew 'git'
brew 'htop'
brew 'nano'
brew 'grep'
#brew 'screen'
brew 'less'
brew 'mackup'
brew 'mas'
brew 'prettyping'
brew 'the_silver_searcher'
brew 'wget'
brew 'zplug'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'n'
brew 'gh'

# Applications
cask 'alfred'
cask 'bartender'
cask 'battle-net'
cask 'brave-browser'
cask 'deckset'
cask 'docker'
cask 'dropbox'
cask 'insomnia'
#cask 'istumbler'
#cask 'kitematic'
cask 'little-snitch'
cask 'muzzle'
cask 'ngrok'
#cask 'phpstorm'
#cask 'robomongo'
#cask 'sequel-pro'
cask 'sonos'
cask 'spotify'
cask 'tableplus'
cask 'toggl'
#cask 'viscosity'
cask 'visual-studio-code'
#cask 'vlc'
#cask 'whatsapp'
cask 'zoomus'

# Fonts
cask 'font-inconsolata'
cask 'font-inconsolata-dz'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-comfortaa'
cask 'font-hack'
cask 'font-nexa'
cask 'font-montserrat'
cask 'font-inter'

# App store

mas 1462114288 # Grammarly for Safari (9.4)
mas 1333542190 # 1Password 7 (7.3.2)
mas 441258766 # Magnet (2.4.4)
mas 409183694 # Keynote (9.2)
#mas 408981434 # iMovie (10.1.13)
mas 1020812363 # CopyClip (3.4)
mas 668208984 # GIPHY CAPTURE (4.1)
mas 1107421413 # 1Blocker (1.4.8)
mas 585829637 # Todoist (7.1.4)
mas 409201541 # Pages (8.2)
mas 803453959 # Slack (4.1.0)
mas 1458969831 # JSONPeep (1.1)
mas 1472777122 # Honey (11.6.4)
mas 409203825 # Numbers (6.2)
mas 948176063 # Boom 2 (1.6.8)
mas 972028355 # Micro Snitch (1.3.1)

# Remove outdated versions from the cellar
cleanup
